benchmark_results_replicated/20260423_101844/analysis/rep15/run/go_heavy_c50/wrk_output.txt
Running 1m test @ http://localhost:8080/days-since-heavy
  4 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    91.43ms   73.61ms 591.00ms   56.11%
    Req/Sec   145.34     47.86   333.00     71.38%
  Latency Distribution
     50%   96.27ms
     75%  106.87ms
     90%  197.28ms
     99%  308.30ms
  34798 requests in 1.00m, 4.68MB read
Requests/sec:    579.07
Transfer/sec:     79.74KB
P95: 211759
P99: 308296